app/controllers/cards_controller.rb

SELECT "cards".* FROM "cards"
---
	def index
	@q = Card.search(params[:q])

SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT 1  [["id", "6"]]
---
	def edit
		@card = Card.find(params[:id])

INSERT INTO "cards" ("announcement", "birthday", "birthplace", "correspondence", "created_at", "deceasedon", "first_name", "funeral", "last_name", "lastresidence", "picture_content_type", "picture_file_name", "picture_file_size", "picture_updated_at", "poem", "province", "signed", "updated_at", "visitaddress") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
	  @card = Card.new(card_params)
	  if @card.save

SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 6]]
---
	def destroy
 		@card = Card.find(params[:id])
    @card.destroy